app/controllers/api/v1/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:user][:email])